app/controllers/ride_offers_controller.rb

SELECT "ride_offers".* FROM "ride_offers"
---
  def index
    @ride_offers = RideOffer.all

INSERT INTO "ride_offers" ("username", "origin", "destination", "rideDate", "rideTime", "moneyRequested", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ride_offer = RideOffer.new(ride_offer_params)

    # send_emails

    respond_to do |format|
      if @ride_offer.save

DELETE FROM "ride_offers" WHERE "ride_offers"."id" = ?  [["id", 2]]
---
  def destroy
    @ride_offer.destroy

SELECT  "ride_offers".* FROM "ride_offers" WHERE "ride_offers"."id" = ? LIMIT 1  [["id", 10]]
---
    def set_ride_offer
      @ride_offer = RideOffer.find(params[:id])