app/controllers/ride_requests_controller.rb

  def index
    @ride_requests = RideRequest.all
---
SELECT "ride_requests".* FROM "ride_requests"

  def create
    @ride_request = RideRequest.new(ride_request_params)

    respond_to do |format|
      if @ride_request.save
---
INSERT INTO "ride_requests" ("username", "origin", "destination", "rideDate", "rideTime", "moneyOffered", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @ride_request.destroy
---
DELETE FROM "ride_requests" WHERE "ride_requests"."id" = ?  [["id", 3]]

    def set_ride_request
      @ride_request = RideRequest.find(params[:id])
---
SELECT  "ride_requests".* FROM "ride_requests" WHERE "ride_requests"."id" = ? LIMIT 1  [["id", 3]]